[ 
    {
      "title": "Що таке інтернет та як він працює?",
      "content": "Інтернет це глобальна мережа в якій всі пристрої з'єднані між собою та мають свій унікальний ідентифікатор IP, та за допомогою протоколів ці пристрої можуть обмінюватись даними."
    },
    {
      "title": "З чого складається URI?",
      "content": "<ol><li>Протокол передачі даних https://</li><li>subdomain.domain.root_domain</li><li>port (http-80, https-443), але він не показується за замовченням</li><li>path - путь до конкретної сторінки або файлу на сайті</li><li>query param - фільтри, сортування, доп. параметри</li><li>anchor - якір, для переходу до певної частини сторінки</li></ol>"
    },
    {
      "title": "Що таке DNS, IP, domain?",
      "content": "<b>DNS</b>: Система, яка перетворює доменні імена (наприклад, google.com) в IP-адреси. <br><b>IP-адреса</b>: Кожен пристрій має унікальну IP-адресу, яка слугує ідентифікатором у мережі"
    },
    {
        "title":
            "Що таке клієнт-серверна архітектура?",
        "content": 
            "Клієнт-серверна архітектура - це спосіб організації взаємодії між пристроями, де клієнт запитує дані або послуги, а сервер їх надає. <br>Існують однорангові та багаторангові архітектури <br><b>однорангові</b> - клієнт - клієнт <br><b>багаторангові</b> - клієнт - сервер - БД <br>На сервері зберігається код додатка, та виконується логіка <br>А в Базі Даних зберігається самі дані, та там ми можемо швидко шукати їх."
    },
    {
      "title":
          "Що може виступати в ролі клієнта?",
      "content": 
          "В ролі клієнта виступає - <b>браузер</b>, <b>мобільний додаток</b>, або <b>десктоп додаток</b>"
    },
    {
      "title":
          "Які браузери ви знаєте? У чому їх відмінність?",
      "content": 
          "<b>Google Chrome</b> — швидкий, простий у використанні, інтегрований із сервісами Google, але споживає багато пам’яті. </br><b>Mozilla Firefox</b> — безпечний, налаштовуваний, підтримує конфіденційність, але трохи повільніший за Chrome. </br><b>Microsoft Edge</b> — швидкий, інтегрований із Windows, енергоефективний, має функції для роботи з PDF. </br><b>Safari</b> — оптимізований для пристроїв Apple, енергоефективний і швидкий, але доступний лише на macOS та iOS. </br><b>Opera</b> — має вбудований VPN, блокувальник реклами та компактний дизайн, але менш популярний. </br><b>Tor Browser</b> — забезпечує анонімність і доступ до мережі Tor, але повільніший через захист даних."
    },
    {
      "title":
          "Що таке OSI model?",
      "content": 
          "Open Systems Interconnection model - модель зв'язки мережевих протоколів. <br>За допомогою цієї моделі різні пристрої можуть взаємодіяти один з одним.</br>Є <b>сім рівнів</b> в цій моделі:</br>1) <b>Фізичний рівень</b> (Physical layer):<br>Відповідає за передачу сигналів через фізичне середовище (дроти, оптоволокно, радіохвилі).<br>Приклад: кабелі Ethernet, Wi-Fi.<br>2) <b>Канальний</b> рівень (Data Link layer):<br>Забезпечує передачу даних між пристроями в межах однієї мережі та виправляє помилки.<br>Приклад: MAC-адреса, протоколи Ethernet.<br>3) <b>Мережевий рівень</b> (Network layer):<br>Відповідає за маршрутизацію даних між різними мережами.<br>Приклад: IP-адреса, протокол IP (IPv4, IPv6).<br>4) <b>Транспортний рівень</b> (Transport layer):<br>Забезпечує надійність передачі даних, контроль цілісності та їх послідовність.<br>Приклад: TCP (надійний) та UDP (швидкий).<br>5) <b>Сеансовий рівень</b> (Session layer):<br>Керує встановленням, підтримкою та завершенням сеансів зв'язку між пристроями.<br>Приклад: протокол NetBIOS.<br>6) <b>Рівень представлення</b> (Presentation layer):<br>Перетворює дані у формат, зрозумілий додаткам, і шифрує/розшифровує їх.<br>Приклад: SSL/TLS, кодування ASCII.<br>7) <b>Прикладний рівень</b> (Application layer):<br>Забезпечує доступ користувачам до мережевих сервісів і програм.<br>Приклад: HTTP, FTP, SMTP (електронна пошта)."
    },
    {
      "title":
          "Які протоколи передачі даних ви знаєте?",
      "content": 
          "Найпопулярніші протоколи з якими працюють програмісти:<br><br><b>Транспортний рівень</b>:<br><b>TCP</b> - це протокол який встановлює handshake, надає надійність передачі даних<br><b>UDP</b> - цей протокол не має handshake, але гарантує швидкість передачі даних<br><b>QUIC</b> - надбудова над протоколом UDP який, і надійний, і гарантує швидкість передачі даних<br><br><b>Прикладний рівень</b>:<br><b>HTTP</b> (HyperText Transfer Protocol) — це протокол передачі гіпертексту, який використовується для обміну даними між веб-браузером (клієнтом) і веб-сервером.<br><b>FTP</b> (File Transfer Protocol) — це протокол для передачі файлів між комп'ютерами в мережі. Він дозволяє завантажувати файли з сервера на клієнт і завантажувати файли з клієнта на сервер. FTP не забезпечує шифрування, що робить його незахищеним"
    },
    {
      "title":
          "Що таке REST API, SOAP? У чому різниця?",
      "content": 
          "<b>REST API</b> (Representational State Transfer) — це архітектурний стиль для створення API, що використовує HTTP для запитів (GET, POST, PUT, DELETE) і працює з ресурсами (URL).<br>Легкий, простий у використанні, масштабований.<br><br><b>SOAP</b> (Simple Object Access Protocol) — це протокол обміну повідомленнями, який використовує XML для передачі даних і суворі стандарти для обробки запитів.<br>Більш складний, забезпечує високий рівень безпеки та транзакцій.<br><br><b>Різниця</b>: REST простіший, швидший і легший у налаштуванні, тоді як SOAP підходить для складних і захищених систем із чіткими стандартами."
    },
    {
      "title":
          "Різниця між TCP та UDP + QUIC",
      "content": 
          "<b>TCP</b> - надійність, упорядкованість, важкий<br><b>UDP</b> - ненадійність, неупорядкованість, легкий<br><b>QUIC</b>- надійність, упорядкованість, легкий"
    },
    {
      "title":
          "Чим відрізняється HTTP від HTTPS?",
      "content": 
          "HTTPS = HTTP + TCP + TLS (S = Secure)<br>HTTPS - надає надійність передачі даних у зв'язку з протоколом TLS."
    },
    {
      "title":
          "Які HTTP-методи ви знаєте?",
      "content": 
          "GET, POST, PUT, PATCH, DELETE, OPTIONS, TRACE, CONNECT, HEAD<br><br><b>GET</b>: Отримати ресурс.<br><b>POST</b>: Надіслати дані на сервер (наприклад, при заповненні форми).<br><b>PUT</b>: Повністю оновити ресурс.<br><b>PATCH</b>: Часткове оновлення ресурсу.<br><b>DELETE</b>: Видалити ресурс.<br><b>OPTIONS</b>: Запит на отримання доступних методів для ресурсу або сервера, працює як ping.<br><b>TRACE</b>: Використовується для діагностики, повертає те саме, що було надіслано в запиті.<br><b>CONNECT</b>: Використовується для створення тунелю (зазвичай для HTTPS-з'єднань через проксі).<br><b>HEAD</b>: Запит на отримання тільки заголовків відповіді без тіла, корисний для перевірки метаданих."
    },
    {
      "title":
          "З чого складається HTTP запит?",
      "content": 
          "1) Метод<br>2) URL<br>3) Заголовки (Headers)<br>4) Тіло запиту (Body)"
    },
    {
      "title":
          "Які приклади HTTP headers ви знаєте?",
      "content": 
          "<b>Заголовки запиту (Request Headers)</b>:<br><br><b>User-Agent</b> — інформує сервер про тип клієнта (браузер або програму), що здійснює запит.<br>Приклад: User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/58.0.3029.110 Safari/537.36<br><b>Accept</b> — визначає типи медіа, які клієнт готовий приймати від сервера.<br>Приклад: Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8<br><b>Authorization</b> — містить облікові дані для авторизації на сервері.<br>Приклад: Authorization: Bearer <token><br><b>Content-Type</b> — вказує формат тіла запиту, наприклад, при надсиланні форм або даних.<br>Приклад: Content-Type: application/json<br><b>Accept-Language</b> — вказує переваги щодо мов, які клієнт може приймати.<br>Приклад: Accept-Language: en-US,en;q=0.9,uk;q=0.8<br><b>Cookie</b> — передає збережені cookies від клієнта до сервера.<br>Приклад: Cookie: sessionId=abc123; user=JohnDoe<br><br><b>Заголовки відповіді (Response Headers)</b>:<br><br><b>Content-Type</b> — визначає тип вмісту відповіді.<br>Приклад: Content-Type: application/json; charset=UTF-8<br><b>Cache-Control</b> — вказує, як і де можна кешувати відповідь.<br>Приклад: Cache-Control: no-cache, no-store, must-revalidate<br><b>Location</b> — використовується для перенаправлення (редиректу) на іншу URL-адресу.<br>Приклад: Location: https://example.com/new-page<br><b>Set-Cookie</b> — відправляє cookies на клієнт.<br>Приклад: Set-Cookie: sessionId=abc123; Path=/; Secure; HttpOnly<br><b>Content-Length</b> — вказує довжину тіла відповіді в байтах.<br>Приклад: Content-Length: 348<br><b>Server</b> — надає інформацію про сервер, що обробив запит.<br>Приклад: Server: Apache/2.4.1 (Unix)"
    },
    {
      "title":
          "Чи є у HTTP пріоритет запитів?",
      "content": 
          "Так є, у http 2 та http 3. Вирішує браузер які запити надсилати першими"
    },
    {
      "title":
          "Хто вирішує яку версію протоколу використовувати?",
      "content": 
          "Браузер та сервер, домовляються яку версію вони підтримують. Ця домовленість відбувається в handshake"
    },
    {
      "title":
          "Чим відрізняється GET від POST?",
      "content": 
          "<b>GET</b>: <br>- Використовується для отримання інформації з сервера. <br>- Дані передаються через URL в рядку запиту<br>- Максимальна довжина запиту 2048 символів<br><br><b>POST</b>: <br>- Використовується для надсилання даних на сервер (наприклад, при заповненні форм). Зазвичай змінює стан сервера (створює або оновлює ресурси).<br>- Дані передаються в тілі запиту (body)<br>- Немає обмежень на кількість"
    },
    {
      "title":
          "Чи існує у GET метода Request body?",
      "content": 
          "Він існує, але його не заведено надсилати"
    },
    {
      "title":
          "Чим відрізняється PUT від PATCH?",
      "content": 
          "<b>PUT</b>: Оновлює або замінює існуючий ресурс повністю, не вказані поля будуть замінені значеннями за замовчуванням або видалені. Якщо ресурс не існує, зазвичай створюється новий.<br><br><b>PATCH</b>: Оновлює лише частину ресурсу, лише ті дані, які вказані в запиті. Інші частини ресурсу залишаються без змін."
    },
    {
      "title":
          "Охарактеризуйте кожен клас статус-кодів (1xx, 2xx, 3xx, 4xx, 5xx)",
      "content": 
          ""
    },
    {
      "title":
          "Яка різниця між 401 та 403 кодом?",
      "content": 
          ""
    },
    {
      "title":
          "Може сервер надіслати код 400, якщо проблема на його боці?",
      "content": 
          "Ні, для помилок, які виникають через проблеми на сервері, використовуються 5xx статус-коди"
    },
    {
      "title":
          "Що таке XML і JSON, які відмінності між ними?",
      "content": 
          ""
    },
    {
      "title":
          "Які типи даних підтримує JSON?",
      "content": 
          ""
    },
    {
      "title":
          "Яке максимальне число можна помістити в JSON?",
      "content": 
          "Проблеми починаються з занадто великими числами рекомендується не більше 2⁵³-1"
    },
    {
      "title":
          "Що таке cache? Види cache? Що зберігає?",
      "content": 
          ""
    },
    {
      "title":
          "Який Http header відповідає скільки часу зберігати cache?",
      "content": 
          ""
    },
    {
      "title":
          "Що таке Cookie? Що зберігає? Навіщо потрібні?",
      "content": 
          ""
    },
    {
      "title":
          "Як зробити, щоб JS код на клієнті не зміг прочитати Cookie?",
      "content": 
          "Використовувати атрибут httpOnly"
    },
    {
      "title":
          "Як зробити, щоб Cookie передавались тільки по HTTPS?",
      "content": 
          "Використовувати атрибут secure"
    },
    {
      "title":
          "Що таке Local storage? Що зберігає?",
      "content": 
          ""
    },
    {
      "title":
          "Що таке ідентифікація, аутентифікація, авторизація?",
      "content": 
          "<b>Ідентифікація</b> - відповідає на питання Хто це?<br><b>Аутентифікація</b> - Докажи що це ти<br><b>Авторизація</b> - Який доступ до системи ти маєш"
    },
    {
      "title":
          "Навіщо потрібні інструменти розробника в браузері (Chrome DevTools) і як вони допомагають у тестуванні?",
      "content": 
          ""
    },
    {
      "title":
          "Навіщо очищати кеш?",
      "content": 
          ""
    },
    {
      "title":
          "Які види тестування можна застосувати лише до Web?",
      "content": 
          ""
    },
    {
      "title":
          "Які методи взаємодії з API існують? У чому різниця між ними?",
      "content": 
          ""
    },
    {
      "title":
          "Як можна протестувати API, що там потрібно перевіряти?",
      "content": 
          ""
    },
    {
      "title":
          "Що таке HTML/CSS/JavaScript?",
      "content": 
          ""
    },
    {
      "title":
          "Різниця між margin та padding?",
      "content": 
          ""
    },
    {
      "title":
          "Яку структуру має вебсторінка?",
      "content": 
          ""
    },
    {
      "title":
          "Які Web elements ви знаєте?",
      "content": 
          ""
    },
    {
      "title":
          "Що таке тестування?",
      "content": 
          "Процес, де ми досліджуємо програму чи документацію цієї програми з певною метою (знайти баг, підтвердити, що продукт готовий до релізу тощо)"
    },
    {
      "title":
          "Назвіть цілі тестування",
      "content": 
          "- Виявити дефекти до того, як їх виявляють користувачі.<br>- Надання актуальної інформації про стан продукту зараз.<br>- Перевірка на відповідність ПЗ всім заявленим вимогам."
    },
    {
      "title":
          "Які принципи тестування ви знаєте?",
      "content": 
          "1) <b>Testing shows the presence of defects</b> , not their absence (Тестування демонструє наявність дефектів, але не гарантує їх відсутності).<br><br>2) <b>Exhaustive testing is not possible</b> (Вичерпне тестування неможливе).<br><br>3) <b>Early testing saves time and money</b> (Тестування слід починати на ранніх стадіях життєвого циклу розробки програмного забезпечення, щоб знайти дефекти якомога раніше).<br><br>4) <b>Defects cluster together</b> (Накопичення дефектів. Принцип Паретто: для багатьох явищ 80 відсотків наслідків спричинені 20 відсотками причин).<br><br>5) <b>Beware of the pesticide paradox</b> (Парадокс пестициду. Якщо повторювати ті самі тести знову і знову, то в певний момент цей набір тестів перестане виявляти нові дефекти).<br><br>6) <b>Testing is context dependent</b> (Тестування залежить від контексту).<br><br>7) <b>Absence of errors is a fallacy</b> (Відсутність знайдених дефектів під час тестування не завжди означає готовність продукту до релізу)."
    },
    {
      "title":
          "Коли слід починати тестування?",
      "content": 
          "Слід розпочинати тестування на ранніх стадіях життєвого циклу розробки ПЗ, щоб знайти дефекти якомога раніше.<br>(Пам'ятаємо про принцип №3 – раннє тестування (Early testing))"
    },
    {
      "title":
          "Опишіть життєвий цикл Програмного Забезпечення SDLC",
      "content": 
          "<b>Software development lifecycle</b>  – період часу, який починається з моменту ухвалення рішення про необхідність створення програмного продукту та закінчується в момент його повного вилучення з експлуатації.<br>- Планування та аналіз вимог<br>- Дизайн архітектури продукту<br>- Розробка продукту (програмування)<br>- Тестування продукту<br>- Розгортання продукту (реліз)<br>- Супровід"
    },
    {
      "title":
          "Що таке entry criteria та exit criteria?",
      "content": 
          "<b>Entry criteria</b>  (критерії входу в тестування) визначають умови, які мають бути виконані до початку робіт. Наприклад, визначені вимоги, графік, встановлено програму, що тестується.<br><br><b>Exit criteria</b> (критерії виходу з тестування) визначають, які умови мають бути виконано, щоб завершити рівень тестування або набір тестів. Наприклад, закрито всі завдання і баг репорти, досягнуто певного відсотка пройдених тестів"
    },
    {
      "title":
          "В чому різниця між QC і QA?",
      "content": 
          "<b>Quality Assurance (QA)</b> – QA забезпечує правильність процесу тестування, підходить до контролю якості глобально, стежить за нормалізацією процесів. (Займається тестуванням програми у всіх фазах життєвого циклу програмного забезпечення. Найбільше уваги в роботі приділяє процесам, але також займається тестуванням продукту.)<br><br><b>Quality Control (QC)</b> – QC передбачає контроль за дотриманням вимог. (Займається тестуванням програми у фазах розробки та тестування. На роботі займається продуктом (додатком, сайтом).<br><br>На практиці все робить одна людина"
    },
    {
      "title":
          "Які методології управління проєктами ви знаєте?",
      "content": 
          "Waterfall<br><br>V-модель<br><br>Ітераційна, інкрементальна модель (відмінність: в ітераційній моделі ідея проєкту спочатку маленька, але потім з’являються додаткові функції. В інкрементальній моделі ідея проєкту від самого початку велика)<br><br>Спіральна модель<br><br>Модель хаоса<br><br>Гнучка модель( Agile (еджаїл): Scrum, Kanban)"
    },
    {
      "title":
          "Що таке Waterfall?",
      "content": 
          "Waterfall Model – відома послідовним проходженням стадій, кожна з яких має завершитись повністю до початку наступної. <br><br>Найчастіше використовується в медичних та військових проєктах. <br><br>Переваги: вартість і дедлайни визначені заздалегідь; розробка відбувається швидко; хороший результат лише у проєктах із чітко та заздалегідь визначеними вимогами.<br><br>Недоліки: неможливо повернутись на попередню фазу або повторити фазу; неможливо змінити вимоги під час розробки"
    },
    {
      "title":
          "Що таке Agile?",
      "content": 
          "Методологія Agile - це набір практик, метою яких є оперативна реакція на зміни під час робочого процесу. Такі підходи допомагають командам швидко реагувати на зворотний зв'язок від клієнтів та замовників, тим самим постійно покращуючи вироблений продукт.<br><br>- <b>Цінності Agile</b>:<br><br>- Люди та співпраця важливіші за процеси та інструменти <br>- Працюючий продукт важливіший за вичерпну документацію <br>- Співпраця із замовником важливіша за обговорення умов             контракту<br>- Готовність до змін важливіша за дотримання плану<br><br>- <b>Суть Agile маніфесту</b>:<br><br>- Вся робота над проектом розділяється на короткі цикли (ітерації) і ведеться поетапно;<br>- В кінці кожної ітерації замовник отримує готовий мінімально робочий продукт чи його частину, яку вже можна використовувати;<br>- Протягом всього робочого процесу команда співпрацює з замовником;<br>- Будь-які зміни в проекті вітаються і швидко інтегруються в роботу."
    },
    {
      "title":
          "Що ви знаєте про Scrum?",
      "content": 
          "Підхід передбачає взаємодію кожного етапу розробки ПЗ, як команди розробників (Delivery Team), а й самого замовника (Product owner), і навіть Scrum-майстра.<br><br>Суть даного фреймворку:<br><br>- Робота ділиться на спринти тривалістю 1-4 тижні<br><br>- Перед початком спринта команда сама формує список задач на ітерацію<br><br>- Під час кожного спринта створюється продукт чи послуга, які можна продемонструвати клієнту<br><br>- Після виконання спринту проводиться ретроспектива. Це мітинг, мета якого отримати фідбек від кожного учасника команди, виявити поточні успіхи та проблеми, тобто оцінка та аналіз виконаної роботи.<br><br>- Кожен наступний етап нарощуватиме функціонал проєкту, доки всі функції не будуть реалізовані.<br><br>- Мітинги, які допомагають в процесі роботи: Щоденний стендап, Планування, Ретроспектива та Sprint Review.<br><br>- Обов'язкові ролі: Scrum-master (допомагає вирішити блокери, слідкує за дотриманням скраму) та Product Owner (виставляє пріоритети і цілі спринта)"
    },
    {
      "title":
          "Розкажіть про Цикл тестування в житті ПЗ?",
      "content": 
          "Software testing life cycle – це послідовність дій, які проводяться в процесі тестування, за допомогою яких гарантується якість ПЗ та його відповідність вимогам.<br><br>Етапи STLC циклу: <br><br>- <b>Планування тестування (Test Planning)</b>:<br>Визначення стратегії та цілей тестування. Розробка тестового плану, який включає опис області тестування, ресурси, розклад і бюджет.<br><br>- <b>Аналіз вимог (Requirement Analysis)</b>:<br>Вивчення вимог до продукту визначення тестових сценаріїв і кейсів. Створення матриці вимог та тестів для забезпечення покриття.<br><br>- <b>Проектування тестів (Test Design)</b>:<br>Розробка тестових випадків та сценаріїв на основі вимог. Визначення даних, необхідних для виконання тестів.<br><br>- <b>Реалізація тестів (Test Implementation)</b>:<br>Підготовка тестових середовищ та даних. Запуск тестів та реєстрація результатів.<br><br>- <b>Виконання тестів (Test Execution)</b>:<br>Запуск тестових кейсів та сценаріїв. Запис результатів та виявлення дефектів.<br><br>- <b>Звітність та метрики (Test Reporting and Metrics)</b>:<br>Підготовка звітів про статус тестування та якість продукту.<br>Збір та аналіз метрик тестування</b>.<br><br>- <b>Завершення тестування (Test Closure)</b>:<br>Підготовка фінальних звітів та аналіз виконаного тестування.<br>Підготовка тестової документації та архівування ресурсів."
    },
    {
      "title":
          "Які види тестової документації ви знаєте?",
      "content": 
          "- Buisness requirements<br>- Functional requirements<br>- Test strategy<br>- Test plan<br>- Test cases<br>- Checklists<br>- Bug reports<br>- Test summary reports"
    },
    {
      "title":
          "Що таке вимоги і які види вимог ви знаєте? ",
      "content": 
          "Це документ в якому описується що програма має робити і як. <br>Види:<br>- software requirements (реквайментс)<br>- specification  (спесификейшн)<br>- product requirement document<br>- user stories<br>- acceptance criteria"
    },
    {
      "title":
          "Що таке User Story?",
      "content": 
          "Це неформальні вимоги, що пишуться в один рядок і складаються з трьох частин:<br> “Як …, я хочу …, щоб …”.<br>Також Юзер сторі - це формат завдання в Джирі, який має підзавдання."
    },
    {
      "title":
          "Що таке Test case?",
      "content": 
          "Це інструкція з тестування функціоналу, яка складається з кроків для відтворення, та очікуваного результату"
    },
    {
      "title":
          "З чого складається Test case?",
      "content": 
          "1) ID <br>2) Title<br>3) Description<br>4) Preconditions<br>5) Steps to reproduce<br>6) Expected result<br>7) Attachments"
    },
    {
      "title":
          "Що таке Checklist?",
      "content": 
          "Це список того що ми повинні протестувати. Це може бути список функціоналу, який ми повинні перевірити, або список тестів, які ми повинні виконати"
    },
    {
      "title":
          "Чим відрізняється Сhecklist від Test case?",
      "content": 
          "Чек ліст простіший, тест кейс об'ємний і детальніший"
    },
    {
      "title":
          "Що таке Test plan? ",
      "content": 
          "Тестовий документ, який описує як буде відбуватись процес тестування."
    },
    {
      "title":
          "З чого складається Test plan?",
      "content": 
          "Описуємо як ми будемо тестувати, що будемо/не будемо тестувати, які рівні/техніки будемо використовувати. Описуємо ролі, обов'язки (roles and responsibilities), ризики та способи їх знизити. Entry, exit критерії. Графік, environment"
    },
    {
      "title":
          "Чим Test plan відрізняється від Test strategy?",
      "content": 
          "Test plan це документ який детально описує тестування на маленькому рівні: продукту, релізу, спринту, юніту, фічі. <br><br>Test strategy описує тестування на рівні проєкта, та більш абстрактно, рідко змінюється."
    },
    {
      "title":
          "Що таке Traceability matrix?",
      "content": 
          "Матриця відслідковуваності - табличка, де у колонках записані вимоги, а у рядках тест-кейси, або частина чек лісту. <br>Таким чином ми можемо відслідкувати які тести покривають вимоги а які ні"
    },
    {
      "title":
          "Що таке баг?",
      "content": 
          "Невідповідність до вимог, недолік в програмі"
    },
    {
      "title":
          "Чим дефект відрізняється від баг-репорта?",
      "content": 
          "Баг-репорт - документ, який описує баг. Дефект - формальна назва багу."
    },
    {
      "title":
          "Що таке bug-report?",
      "content": 
          "Докладна покрокова інструкція для відтворення дефекту"
    },
    {
      "title":
          "З чого складається bug-report?",
      "content": 
          "- ID<br>- Назва<br>- Preconditions<br>- Steps<br>- Actual result<br>- Expected result<br>- Severity, Priority<br>- Type<br>- людина, яка зробила цей баг-репорт<br>- людина, яка має його виправити<br>- статус<br>- середовище<br>- скріншоти, відео, час"
    },
    {
      "title":
          "Що таке Severity та Priority?",
      "content": 
          "<b>Severity</b> - критичність багу, як сильно він впливає на роботу системи<br><br><b>Priority</b> - як швидко потрібно виправити баг<br><br>На практиці є тільки Priority"
    },
    {
      "title":
          "Наведіть приклад багу з низьким пріоритетом, але високим ступенем впливу",
      "content": 
          "Наприклад, баг з'являється тільки пілсля 30 кроків, та ламає систему. Такий баг важко відтворити, але коли він з'являється, то він критичний"
    },
    {
      "title":
          "Опишіть життєвий цикл bug-report",
      "content": 
          "- New<br>- Open<br>- Assigned<br>- In progress<br>- Duplicate - якщо такий баг вже є<br>- Deferred - якщо баг не терміновий, то його можна перенести на наступний спрінт<br>- Fixed, verified (перевірено)<br>- Reopened - якщо щось невірно пофіксили<br>- Closed"
    },
    {
      "title":
          "Як ви будете тестувати якщо вимог нема?",
      "content": 
          "Буду застосовувати Exploratory testing, дивитися User story, спілкуватися з розробниками, дивитися на аналогічні функції, на конкурентів, питати Product Owner"
    },
    {
      "title":
          "Коли QA-інженер повинен звертатися за допомогою?",
      "content": 
          "В останню чергу після гугла і конфлюенса. Спочатку питати колегу, потім якщо він не знає то ліда, потім продакт овнера"
    },
    {
      "title":
          "Які види тестування ви знаєте?",
      "content": 
          "- Позитивне\\Негативне<br>- Мануальне\\Автоматизоване<br>- Статичне\\Динамічне<br>- Чорний\\Білий\\Сірий ящик<br>- Функціональне\\Нефункціональне<br>- Пов’язане зі змінами."
    },
    {
      "title":
          "Чим верифікація Verification від Validation?",
      "content": 
          "<b>Verification</b> - це перевірка відповідності вимогам<br><br><b>Validation</b> - перевірка на відповідність очікуванням користувача"
    },
    {
      "title":
          "В чому різниця між статичним та динамічним тестуванням?",
      "content": 
          "<b>Статичне тестування</b> - це перевірка документації <br><b>Динамічне</b> - перевірка програми<br> Статичне може виконуватись без запуска коду, а динамічне тільки з кодом."
    },
    {
      "title":
          "В чому різниця між білим, чорним та сірим ящиками?",
      "content": 
          "<b>White box</b> - маємо повний доступ до коду, та тестуємо його <br><b>Grey box</b> - частковий доступ до коду (Postman)<br><b>Black box</b> - не маємо доступу до коду, тестуємо функціонал"
    },
    {
      "title":
          "В чому різниця між позитивним та негативним тестуванням?",
      "content": 
          "<b>Позитивне тестування</b> - коли ми вводим валідні дані і очікуємо на хороший результат. <br><b>Негативне</b> - коли ми вводимо завідома не коректну інформацію і очікуємо на помилку."
    },
    {
      "title":
          "Скільки негативних перевірок може бути за 1 раз? (Реєстрація, скільки полів можна ввести негативних)?",
      "content": 
          "Тільки одне поле заповнюємо негативною інформацією, всі інші - позитивними. Так легше локалізувати дефект"
    },
    {
      "title":
          "В чому різниця між мануальним та автоматизованим тестуванням?",
      "content": 
          "Мануальне тестування - це тестування з використанням клавіатури і миші, а автоматизоване - це коли інженер написав код, який виконує тестування"
    },
    {
      "title":
          "Які рівні тестування ви знаєте?",
      "content": 
          "1) <b>Unit testing</b> - тестування класів, функцій, методів<br>2) <b>Integration testing</b> - тестування взаємодії між компонентами, модулями<br>3) <b>System testing</b> - тестування системи як функціональне, так і нефункціональне<br>4) <b>Acceptance testing</b> - тестування системи відповідно до вимог та потреб кінцевого користувача"
    },
    {
      "title":
          "Які типи нефункціонального тестування ви знаєте?",
      "content": 
          "Performance - Load, Voluem, Stress, Scalability <br>Security - Vulnerbility, Penetratin <br>Usability<br> Installability<br> Localization<br> Існують ще дуже багато видів нефункціонального тестування, під потрібні цілі"
    },
    {
      "title":
          "Які типи тестування, пов’язані зі змінами, ви знаєте?",
      "content": 
          "1) <b>Re-testing</b> - перевірка виправлення багу<br> 2) <b>Sanity testing</b> - детальна перевірка участку коду, наприклад нової фічі<br> 3) <b>Smoke testing</b> - перевірка основного функціоналу, не вдаючись в делалі. Критичній шлях<br> 4) <b>Regression testing</b> - перевірка чи не зламався старий функцілнал, наприклад піля додавання нової фічі"
    },
    {
      "title":
          "Чим Smoke testing відрізняється від Regression testing?",
      "content": 
          "<b>Smoke</b> - перевіряємо критично важливий шлях, функціонал. <br><b>Regression</b> - перевіряємо старий функціонал, щоб він не зламався з новою доробкою. <br>Зазвичай Смоук проводять безпосередньо перед регресією."
    },
    {
      "title":
          "В чому різниця між Smoke та Sanity testing?",
      "content": 
          "<b>Smoke</b> - перевіряємо критично важливий шлях, функціонал. Зазвичай вважається “поверхневимім” тестуванням.<br><b>Sanity</b> - детальне тестування конкретної невеликої частини; перевірка частини, яка найчастіше виходить з ладу; перевірка нового функціонала. "
    },
    {
      "title":
          "Якщо тест кейсів багато, а часу на тестування нема, як обрати тести на регресію?",
      "content": 
          "Потрібно пріоритезувати тест кейси. Необхідно дивитися спочатку на критично важливий функціонал, який є суттю даного ПО. Якщо вистачить часу, то потрібно ще пройтись по самому популярному шляху продукту та перевірити блок, де було більше всього багів."
    },
    {
      "title":
          "Що таке End-to-End testing?",
      "content": 
          "Перевірка всього ланцюжка взаємодії систем у реальних умовах, починаючи від введення даних до кінцевого результату"
    },
    {
      "title":
          "Які ви знаєте техніки тест дизайну?",
      "content": 
          "1) <b>Вичерпне тестування<b/> <br>2) <b>Еквівалентне розділення (Equivalence partitioning)<b/><br>3) <b>Аналіз граничних значень (Boundary values analysis)</b><br>4) <b>Причина/наслідок (Cause/Effect)</b><br>5) <b>Вгадування помилок (Error guessing)</b><br>6) <b>Попарне тестування (Pairwise)</b><br>7) <b>Таблиця прийняття рішень (Decision table)</b><br>8) <b>Діаграма станів і переходів (State transition)</b><br>9) <b>Use case</b><br>10) <b>Дослідницьке тестування (Exploratory testing)</b>"
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "Що таке Postman і для чого він використовується?",
      "content": 
          "Postman — це популярний інструмент для тестування API. <br>Він дозволяє надсилати запити до API, аналізувати відповіді, автоматизувати тести та створювати документацію. <br>Postman використовується для перевірки правильності роботи REST API, тестування функціоналу, перевірки помилок і забезпечення відповідності вимогам."
    },
    {
      "title":
          "Які основні функції Postman ви знаєте?",
      "content": 
          "- Створення та надсилання HTTP-запитів (GET, POST, PUT, DELETE тощо).<br>- Робота з параметрами запиту (Query Params, Path Variables).<br>- Налаштування авторизації (Basic Auth, Bearer Token, OAuth тощо).<br>- Тестування API за допомогою тестових скриптів.<br>- Робота з колекціями (Collections) для групування запитів.<br>- Збереження та використання змінних середовища (Environment Variables).<br>- Аналіз JSON-відповідей та перевірка даних у відповіді.<br>- Автоматизація тестів"
    },
    {
      "title":
          "Як створити новий запит у Postman?",
      "content": 
          "- Відкрити Postman і натиснути \"New\" або \"+\" (новий таб).<br>- Вибрати тип запиту (GET, POST тощо) у випадаючому списку.<br>- Ввести URL API в полі для адреси.<br>- За потреби додати параметри, заголовки (Headers) або тіло запиту (Body).<br>- Натиснути кнопку \"Send\", щоб надіслати запит і переглянути відповідь."
    },
    {
      "title":
          "Як організувати запити в колекції?",
      "content": 
          "1) Створіть нову колекцію: натисніть \"New\" → \"Collection\" і задайте їй ім'я.<br>2) Відкрийте запит, який потрібно додати до колекції.<br>3) Натисніть \"Save\" → виберіть потрібну колекцію → натисніть \"Save to Collection\".<br>4) Всі запити у колекції можна групувати в папки та виконувати послідовно за допомогою Runner."
    },
    {
      "title":
          "Які типи авторизації підтримує Postman?",
      "content": 
          "Postman підтримує кілька типів авторизації:<br><br>- <b>No Auth</b>: Запит без авторизації.<br>- <b>Basic Auth</b>: Простий метод, де логін і пароль передаються в заголовках (Headers) запиту.<br>- <b>Bearer Token</b>: Використовується для передачі токена доступу у заголовках.<br>- <b>OAuth 1.0 і OAuth 2.0</b>: Для складної авторизації з використанням токенів.<br>- <b>API Key</b>: Передача ключа API через параметри запиту, заголовки або тіло.<br>- <b>Digest Auth</b>: Більш безпечна альтернатива Basic Auth, де паролі хешуються.<br>- <b>Hawk Authentication</b>: Захист HTTP запитів із підписами.<br>- <b>AWS Signature</b>: Авторизація для сервісів AWS."
    },
    {
      "title":
          "Що таке токен авторизації, і як ви його використовували?",
      "content": 
          "Токен авторизації — це унікальний ключ, який використовується для підтвердження доступу до API. <br>Він зазвичай генерується сервером і передається в запитах як частина заголовків, параметрів або тіла запиту.<br><br>Використання:<br>У Postman токен передається у вкладці \"Authorization\" (Bearer Token).<br>Ви додаєте токен у відповідне поле, і Postman автоматично додає його до заголовків запиту."
    },
    {
      "title":
          "Як зберігти значення поля з відповіді у форматі JSON у змінну середовища у Postman?",
      "content": 
          "Використати script:<br>var jsonData = pm.response.json();<br>pm.environment.set(\"petId\", jsonData.id)<br><br><b>var jsonData = pm.response.json()</b>;<br>pm.response.json() перетворює тіло відповіді сервера (response body) у формат JSON в об'єкт JavaScript.<br>Результат зберігається у змінній jsonData.<br>pm.environment.set(\"petId\", jsonData.id);<br><br><b>pm.environment.set</b> — функція для створення або оновлення змінної середовища в Postman.<br>\"petId\" — назва змінної середовища.<br>jsonData.id — доступ до значення поля id у відповіді."
    },
    {
      "title":
          "Яка різниця між змінними середовища та глобальними змінними у Postman?",
      "content": 
          "Змінні (variable) середовища доступні лише для певного середовища (environment), а глобальні змінні доступні у всіх середовищах"
    },
    {
      "title":
          "Як використовувати змінну середовища у запиті?",
      "content": 
          "У запитах змінна середовища вставляється за допомогою синтаксису {{variableName}}"
    },
    {
      "title":
          "Що таке Postman Interceptor?",
      "content": 
          "Postman Interceptor — це розширення для браузера Google Chrome, яке дозволяє:<br>- Перехоплювати мережеві запити (HTTP/HTTPS) прямо з браузера.<br>- Використовувати cookie з браузера в запитах, що виконуються в Postman.<br>Це корисний інструмент для роботи з API, оскільки він допомагає аналізувати реальні запити, які надсилає браузер, і повторювати їх у Postman для тестування"
    },
    {
      "title":
          "Розкажіть про себе.",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "Розкажіть про себе.",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "",
      "content": 
          ""
    },
    {
      "title":
          "Розкажіть про себе.",
      "content": 
          ""
    }
  ]